foodr-backend/app/controllers/products_controller.rb

  def search
    search_term = params[:search_term]
    product = Product.find_by(upc: search_term) || Product.find_by(name: search_term)
---
SELECT  "products".* FROM "products" WHERE "products"."name" = $1 LIMIT $2  [["name", "6"], ["LIMIT", 1]]