foodr-backend/app/controllers/products_controller.rb

  def search_upc
    search_term = params[:search_term]
    product = Product.find_by(upc: search_term)
---
SELECT  "products".* FROM "products" WHERE "products"."upc" = $1 LIMIT $2  [["upc", "Quaker chewey"], ["LIMIT", 1]]

  def search_name
    search_term = params[:search_term]
    product = Product.find_by(name: search_term)
    # Does a fuzzy search if exact product name wasn't found
    if !product
      possible_matches = Product.fuzzy_search(name: search_term)
    end
    if product
      if params[:user_id]
        search = Search.create(user_id: params[:user_id], product_id: product.id, is_saved: false)
      end
      render json: {
        found: true,
        product: product,
        ingredients: product.ingredients,
        search: search
      }.to_json
    elsif possible_matches.any?
---
SELECT  "products".* FROM "products" WHERE "products"."name" = $1 LIMIT $2  [["name", "1"], ["LIMIT", 1]]
SELECT  1 AS one FROM "products" WHERE (("products"."name" % 'Quaker')) LIMIT $1  [["LIMIT", 1]]