foodr-backend/app/controllers/users_controller.rb

SELECT "searches".* FROM "searches" WHERE "searches"."user_id" = $1  [["user_id", 1]]
---
  def show
    user = User.find_by(id: params[:id])

    if user
      searches = user.searches

      # find recent searches
      searches = user.recent_searches

      # add product name & img_url to each search
      searched_products = searches.map do |search|