foodr-backend/app/controllers/users_controller.rb

  def show
    user = User.find_by(id: params[:id])

    if user
      searches = user.products
      saved_product_ids = user.searches.where(is_saved: true).pluck(:product_id)
      saved_products = Product.find(saved_product_ids)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "searches"."product_id" FROM "searches" WHERE "searches"."user_id" = $1 AND "searches"."is_saved" = $2  [["user_id", 1], ["is_saved", "t"]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]